# Pandas

In [1]:
import numpy as np
import pandas as pd

In [5]:
labels=['a','b','c']

mylist=[10,20,30]

arr=np.array([10,20,30])

d={'a':10,'b':20,'c':30}

In [8]:
pd.Series(data=mylist,index=labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [10]:
salesQ1=pd.Series(data=[100,200,200,400],index=['USA','iNDIA','JAPAN','CHINA'])

In [11]:
salesQ1

USA      100
iNDIA    200
JAPAN    200
CHINA    400
dtype: int64

In [13]:
salesQ1['USA']

100

Pandas Dataframe

In [14]:
import numpy as np
import pandas as pd

In [19]:
columns=['W','X','Y','Z']
index=['A','B','C','D','E']

from numpy.random import randint
np.random.seed(42)
data=randint(-100,100,(5,4))
data

array([[  2,  79,  -8, -86],
       [  6, -29,  88, -80],
       [  2,  21, -26, -13],
       [ 16,  -1,   3,  51],
       [ 30,  49, -48, -99]])

In [20]:
df=pd.DataFrame(data,index,columns)

In [21]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [24]:
df[['W','X']]

    W   X
A   2  79
B   6 -29
C   2  21
D  16  -1
E  30  49

In [27]:
df['new']=df['X']+df['Y']
df['new']
df

    W   X   Y   Z  new
A   2  79  -8 -86   71
B   6 -29  88 -80   59
C   2  21 -26 -13   -5
D  16  -1   3  51    2
E  30  49 -48 -99    1

In [31]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [34]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [35]:
df.loc['A'] #loc for rows

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [38]:
df.loc[['A','B']]

   W   X   Y   Z
A  2  79  -8 -86
B  6 -29  88 -80

In [39]:
df.iloc[0] #integer location in rows

W     2
X    79
Y    -8
Z   -86
Name: A, dtype: int32

In [40]:
df.drop('A')

    W   X   Y   Z
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [41]:
df.loc['B','W']

6

In [42]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [44]:
df[df>0]

    W     X     Y     Z
A   2  79.0   NaN   NaN
B   6   NaN  88.0   NaN
C   2  21.0   NaN   NaN
D  16   NaN   3.0  51.0
E  30  49.0   NaN   NaN

In [46]:
df[df['X']>0]

    W   X   Y   Z
A   2  79  -8 -86
C   2  21 -26 -13
E  30  49 -48 -99

In [47]:
df

    W   X   Y   Z
A   2  79  -8 -86
B   6 -29  88 -80
C   2  21 -26 -13
D  16  -1   3  51
E  30  49 -48 -99

In [48]:
new_ind=['ca','ba','da','ea','fa']
df['state']=new_ind

In [49]:
df

    W   X   Y   Z state
A   2  79  -8 -86    ca
B   6 -29  88 -80    ba
C   2  21 -26 -13    da
D  16  -1   3  51    ea
E  30  49 -48 -99    fa

In [50]:
df.set_index('state')

        W   X   Y   Z
state
ca      2  79  -8 -86
ba      6 -29  88 -80
da      2  21 -26 -13
ea     16  -1   3  51
fa     30  49 -48 -99

In [51]:
df.describe()

              W          X          Y          Z
count   5.00000   5.000000   5.000000   5.000000
mean   11.20000  23.800000   1.800000 -45.400000
std    11.96662  42.109381  51.915316  63.366395
min     2.00000 -29.000000 -48.000000 -99.000000
25%     2.00000  -1.000000 -26.000000 -86.000000
50%     6.00000  21.000000  -8.000000 -80.000000
75%    16.00000  49.000000   3.000000 -13.000000
max    30.00000  79.000000  88.000000  51.000000

In [52]:
df.dtypes

W         int32
X         int32
Y         int32
Z         int32
state    object
dtype: object

Missing Data

In [54]:
import numpy as np
import pandas as pd

df=pd.DataFrame({'A':[1,2,np.nan,4],
                 'B':[5,np.nan,np.nan,8],
                 'C':[10,20,30,40]})
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [56]:
df.dropna(axis=1)

    C
0  10
1  20
2  30
3  40

In [57]:
df.fillna(df.mean())

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40

Pandas Operations

In [58]:
import pandas as pd
df_one=pd.DataFrame({'K1':['A','A','B','B','C','C'],
                    'col1':[100,200,300,300,400,500],
                    'col2':['NY','CA','WA','WA','AK','NV']})

In [59]:
df_one

  K1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
3  B   300   WA
4  C   400   AK
5  C   500   NV

In [63]:
df_one.nunique()

K1      3
col1    5
col2    5
dtype: int64

In [66]:
df_one['col2'].value_counts()

WA    2
NV    1
CA    1
NY    1
AK    1
Name: col2, dtype: int64

In [68]:
df_one.drop_duplicates()

  K1  col1 col2
0  A   100   NY
1  A   200   CA
2  B   300   WA
4  C   400   AK
5  C   500   NV

In [69]:
def grab_first_letter(state):
    return state[0]

In [70]:
grab_first_letter('NY')

'N'

In [72]:
df_one['first_letter']=df_one['col2'].apply(grab_first_letter)

In [73]:
df_one

  K1  col1 col2 first_letter
0  A   100   NY            N
1  A   200   CA            C
2  B   300   WA            W
3  B   300   WA            W
4  C   400   AK            A
5  C   500   NV            N

In [75]:
def complex_letter(state):
    if state[0]=='W':
        return "wash"
    else:
        return "error"

In [77]:
df_one['col2'].apply(complex_letter)

0    error
1    error
2     wash
3     wash
4    error
5    error
Name: col2, dtype: object

In [78]:
my_map={'A':1,'B':2,'C':3}

In [79]:
df_one['num']=df_one['K1'].map(my_map)

In [80]:
df_one

  K1  col1 col2 first_letter  num
0  A   100   NY            N    1
1  A   200   CA            C    1
2  B   300   WA            W    2
3  B   300   WA            W    2
4  C   400   AK            A    3
5  C   500   NV            N    3

In [82]:
features=pd.DataFrame({'A':[1,2,3,4,5],
                      'B':[4,3,5,6,7]})
predcitions=pd.DataFrame({'pred':[0,1,0,1,1]})

In [88]:
pd.concat([features,predcitions],axis=1)

   A  B  pred
0  1  4     0
1  2  3     1
2  3  5     0
3  4  6     1
4  5  7     1

In [89]:
df_one

  K1  col1 col2 first_letter  num
0  A   100   NY            N    1
1  A   200   CA            C    1
2  B   300   WA            W    2
3  B   300   WA            W    2
4  C   400   AK            A    3
5  C   500   NV            N    3

In [90]:
pd.get_dummies(df_one['K1'])

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  1  0
4  0  0  1
5  0  0  1

Data input and output

In [91]:
import numpy as np
import pandas as pd

In [92]:
pwd

'C:\\Users\\SRKT'

african_crises datasets

In [94]:
import pandas as pd
import numpy as np

df=pd.read_csv(r"C:\Users\SRKT\Desktop\african_crises.csv")

In [95]:
df.head()

,case,cc3,country,year,systemic_crisis,exch_usd,domestic_debt_in_default,sovereign_external_debt_default,gdp_weighted_default,inflation_annual_cpi,independence,currency_crises,inflation_crises,banking_crisis
0,1,DZA,Algeria,1870,1,0.052264,0,0,0.0,3.441456,0,0,0,crisis
1,1,DZA,Algeria,1871,0,0.052798,0,0,0.0,14.149140,0,0,0,no_crisis
2,1,DZA,Algeria,1872,0,0.052274,0,0,0.0,-3.718593,0,0,0,no_crisis
3,1,DZA,Algeria,1873,0,0.051680,0,0,0.0,11.203897,0,0,0,no_crisis
4,1,DZA,Algeria,1874,0,0.051308,0,0,0.0,-3.848561,0,0,0,no_crisis

In [96]:
df.shape

(1059, 14)

In [101]:
df['country'].nunique()

13

In [102]:
df['country'].unique()

array(['Algeria', 'Angola', 'Central African Republic', 'Ivory Coast',
       'Egypt', 'Kenya', 'Mauritius', 'Morocco', 'Nigeria',
       'South Africa', 'Tunisia', 'Zambia', 'Zimbabwe'], dtype=object)

In [106]:
df.sort_values('inflation_annual_cpi',ascending=False).head()['country']

1053    Zimbabwe
1052    Zimbabwe
143       Angola
142       Angola
140       Angola
Name: country, dtype: object